# modules/form_fields.py

FIELD_DEFINITIONS = {
    "하자사례": [
        "현장명",
        "발생일",
        "공종",
        "사례 결과",
        "하자 내용",
        "상세 내용",
        "해결 방안",
        "실패 원인"
    ],
    "VE사례": [
        "현장명",
        "VE명",
        "공종",
        "기준안",
        "개선안",
        "기대효과",
        "적용여부"
    ],
    "공사기간": [
        "현장명",
        "구조형식",
        "건축면적",
        "연면적",
        "지하층수",
        "지상층수",
        "공사기간(일수)"
    ],
    "기타사례": [
        "현장명",
        "사례 구분",
        "내용",
        "상세 내용"
    ]
}
